SST/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Phi
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-08;
        relTol          0.001;
    }

    PhiFinal
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-08;
        relTol          0.0;
    }

    p
    {
        solver          PCG;//GAMG;
        
        tolerance       1e-08;
        relTol          0.001;
        preconditioner  DIC;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 300;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 300;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
//        type            coupled;
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
//        tolerance       (1e-06 1e-06 1e-06);
//        relTol          (0.01 0.01 0.01);
    }
    UFinal
    {
//        type            coupled;
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
//        tolerance       (1e-06 1e-06 1e-06);
//        relTol          (0 0 0);
    }

    "(k|omega|nuTilda|epsilon|R|nonlinearStress)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }
    "(k|omega|nuTilda|epsilon|R|nonlinearStress)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

}

potentialFlow
{
    nNonOrthogonalCorrectors 0;
}

SIMPLE
{
    consistent   yes;

//   residualControl 
//   	{ 
//       	p               1e-6; 
//       	U               1e-5; 
//       	"(k|epsilon|omega|nuTilda|R|nonlinearStress)"   1e-6; 
//  	} 
}


relaxationFactors 
{ 
//    fields 
//    { 
//        p               0.7; 
//    } 
    equations 
    { 
        U               0.5; 
        k               0.5; 
        epsilon         0.5; 
	omega           0.5;

    } 
} 


// ************************************************************************* //
